##Домашнее задание к занятию 13 «Введение в мониторинг»

1)Вопрос №1
-- Ответы http-кодам нужно понять отрабатывает ли веб приложение или нет. 
-- Мониторинг свободного места жесткого диска нужно знать когда место может кончиться , для увеличения места жд или запуск скрипта самоочистки.
--IOPS запись и чтение на ЖД 
--Загрузка CPU в разные моменты времени 5Sec   1Min   5Min чтобы понимать загрузку в в интервалах времени 
-- Мониторинг ОЗУ  чтобы понять нет ли утечки памяти переполнения  итд  


2)Вопрос №2
--Расчет SLA 
--А лучше вывести SLA в системе мониторинга видет за промежутки времени. 

3)Вопрос №3

Использовать бесплатную систему сбора логов типа . Elastic Stack, Graylog, Grafana Loki

4)Вопрос №4
--В расчете формулы мы учитываем только 200 запросы на нужно учитывать еще и 300 запросы. 








   
   
